In [109]:
import pandas as pd
import numpy as np

In [110]:

# Creating an array
data = np.array([[1,4],[2,5],[3,6]])
data

array([[1, 4],
       [2, 5],
       [3, 6]])

In [111]:
# Creating a dataframe

# dataframe  = pd.DataFrame(data)
df = pd.DataFrame(data, index =['row1','row2','row3'],columns = ['col1','col2'])

In [112]:
# showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

In [113]:
# lists used for this example
states = ["Madhya Pradesh","Uttar Pradesh", "Arunachal Pradesh", "Maharastra"]
population = [100324,321512,5132,54232]

In [114]:
# sortings lists within a dictionary
dict_states = {'States': states, 'Population':population}

In [115]:
# Creating the dataframe from dic
df_data = pd.DataFrame(dict_states)

In [116]:
# Showing data
df_data

              States  Population
0     Madhya Pradesh      100324
1      Uttar Pradesh      321512
2  Arunachal Pradesh        5132
3         Maharastra       54232

In [117]:
# reading a csv file
df_exams = pd.read_csv('data/StudentsPerformance.csv')

In [118]:
df_exams.head() # top 5 rows
df_exams.tail() # bottom 5 rows

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [119]:
df_exams_female = df_exams[df_exams['gender'] == "female"]
df_exams_female

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [120]:
df_male_toppers = df_exams[(df_exams["gender"]=="male") & (df_exams["math score"] >= 90)]
df_male_toppers

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
34,male,group E,some college,standard,none,97,87,82
104,male,group C,some college,standard,completed,98,86,90
121,male,group B,associate's degree,standard,completed,91,89,92
149,male,group E,associate's degree,free/reduced,completed,100,100,93
171,male,group E,some high school,standard,none,94,88,78
233,male,group E,some high school,standard,none,92,87,78
286,male,group E,associate's degree,standard,completed,97,82,88
299,male,group D,associate's degree,free/reduced,none,90,87,75
306,male,group E,some college,standard,completed,99,87,81
333,male,group B,associate's degree,standard,none,90,78,81
469,male,group C,some college,standard,none,91,74,76
539,male,group A,associate's degree,standard,completed,97,92,86
562,male,group C,bachelor's degree,standard,completed,96,90,92
571,male,group A,bachelor's degree,standard,none,91,96,92
612,male,group C,bachelor's degree,standard,completed,94,90,91
618,male,group D,master's degree,standard,none,95,81,84
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
659,male,group D,associate's degree,standard,none,90,87,85
689,male,group E,some college,free/reduced,none,93,90,83
710,male,group C,some college,standard,completed,93,84,90
719,male,group E,associate's degree,free/reduced,completed,91,73,80
736,male,group C,associate's degree,standard,none,92,79,84
779,male,group E,associate's degree,standard,completed,94,85,82
784,male,group C,bachelor's degree,standard,completed,91,81,79
808,male,group C,high school,standard,none,90,75,69
815,male,group B,some high school,standard,completed,94,86,87
845,male,group E,master's degree,standard,none,90,85,84
846,male,group C,master's degree,standard,completed,91,85,85
864,male,group C,associate's degree,standard,none,97,93,91
873,male,group E,associate's degree,free/reduced,none,90,90,82
916,male,group E,bachelor's degree,standard,completed,100,100,100
919,male,group B,some college,standard,completed,91,96,91
934,male,group C,associate's degree,standard,completed,98,87,90
950,male,group E,high school,standard,none,94,73,71

In [121]:
# showing n numbers of rows
df_exams.head(10)
df_exams.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [122]:
# Dimensions(shape) of the data frame
df_exams.shape

(1000, 8)

In [123]:
# display n rows
# pd.set_option('display.max_rows', 1000) # this will change the setting to show the entered no of rows (e.g 1000) in preview

In [124]:
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [125]:
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [126]:
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [127]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [128]:
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [129]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [130]:
len(df_exams) # no of rows

1000

In [131]:
max(df_exams.index)

999

In [132]:
min(df_exams.index)

0

In [133]:
type(df_exams)

pandas.core.frame.DataFrame

In [134]:
df_exams["gender"]
df_exams.gender
# both are same

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [135]:
type(df_exams.gender)

pandas.core.series.Series

In [136]:
df_exams[["gender","math score"]]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [137]:
df_exams[(df_exams['gender'] == 'female') & (df_exams['math score'] == 89)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
970,female,group D,bachelor's degree,standard,none,89,100,100

In [138]:
df_exams[['gender','lunch','math score']]

     gender         lunch  math score
0    female      standard          72
1    female      standard          69
2    female      standard          90
3      male  free/reduced          47
4      male      standard          76
..      ...           ...         ...
995  female      standard          88
996    male  free/reduced          62
997  female  free/reduced          59
998  female      standard          68
999  female  free/reduced          77

[1000 rows x 3 columns]

In [ ]:
# adding column to dataframe
df_exams['english score'] = 70

df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,english score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

In [142]:
df_exams['english score'] =  np.where(df_exams['math score'] == 72,10,70)
df_exams[df_exams['english score'] == 10]
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,english score
0,female,group B,bachelor's degree,standard,none,72,72,74,10
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

In [148]:
# english_score = np.arange(0,1000)
english_score = np.random.randint(1,100, size=1000)
len(english_score)
df_exams['english score'] = english_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,english score
0,female,group B,bachelor's degree,standard,none,72,72,74,18
1,female,group C,some college,standard,completed,69,90,88,32
2,female,group B,master's degree,standard,none,90,95,93,3
3,male,group A,associate's degree,free/reduced,none,47,57,44,15
4,male,group C,some college,standard,none,76,78,75,71
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,67
996,male,group C,high school,free/reduced,none,62,55,55,83
997,female,group C,high school,free/reduced,completed,59,71,65,71
998,female,group D,some college,standard,completed,68,78,77,55
999,female,group D,some college,free/reduced,none,77,86,86,78

In [275]:
# Floating point numbers
np.random.uniform(1,100, size=100)

array([76.97577752, 90.67760481, 73.03541701, 35.26285957, 56.80575936,
       80.74278594,  9.56754077, 14.24525362, 19.86076547, 62.37554915,
       14.31342377, 66.26283019, 16.39700814, 38.55918893, 14.17290443,
       96.78552525,  8.16193114, 51.79520389, 79.34731817, 36.09439135,
       69.45662369, 37.08530875, 26.04075829, 19.41003774, 90.52424029,
       83.43796756, 44.25419319,  4.28698995, 22.61640497, 66.29587954,
       37.80471041, 46.59073483, 28.70598469, 54.93372676, 99.09382885,
       18.51069529, 58.5200582 ,  6.48816149,  7.89198515, 75.55185597,
       12.428369  , 54.34528308, 11.37340362, 89.60870577, 43.87212668,
        7.06097615, 85.78786327, 68.32855058, 22.69759874, 54.08441743,
       57.6810086 , 59.76296577, 18.40359837, 69.32014374, 14.77382419,
       89.90176079, 85.21347564, 51.99064138, 53.5823145 , 31.85726035,
       72.62904932, 35.14960029, 26.51132864, 14.32474565, 74.87707393,
       15.3139968 , 80.28878267, 55.00063855, 28.00089948,  5.54009599,
       27.08083272, 72.5777365 , 44.14675377, 30.56572822,  3.37582233,
       81.57465416, 55.60462944, 33.77664316, 41.56004244, 21.65926901,
       74.81470394, 39.49244093, 23.01088071, 65.40352363, 65.68309254,
       32.45296222, 41.33632382,  1.36332626, 22.4880738 , 60.41583255,
       32.76574306, 67.38869112, 94.1774324 , 24.92250015, 81.13939072,
       54.11984366,  1.57239755, 83.9062019 ,  9.91174436, 46.13287863])

> complete till here -> [Video Link](https://youtu.be/CMEWVn1uZpQ?t=10333)